In [1]:
import pandas as pd
import numpy as np

In [5]:
data1 = np.arange(0,30).reshape(5,6)

In [7]:
df = pd.DataFrame(data1,index=["Row1","Row2","Row3","Row4","Row5"],columns=["column1","column2","column3","column4","column5","column6",])

In [8]:
df.head()

      column1  column2  column3  column4  column5  column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   column1  5 non-null      int32
 1   column2  5 non-null      int32
 2   column3  5 non-null      int32
 3   column4  5 non-null      int32
 4   column5  5 non-null      int32
 5   column6  5 non-null      int32
dtypes: int32(6)
memory usage: 160.0+ bytes

In [11]:
df.describe()

         column1    column2    column3    column4    column5    column6
count   5.000000   5.000000   5.000000   5.000000   5.000000   5.000000
mean   12.000000  13.000000  14.000000  15.000000  16.000000  17.000000
std     9.486833   9.486833   9.486833   9.486833   9.486833   9.486833
min     0.000000   1.000000   2.000000   3.000000   4.000000   5.000000
25%     6.000000   7.000000   8.000000   9.000000  10.000000  11.000000
50%    12.000000  13.000000  14.000000  15.000000  16.000000  17.000000
75%    18.000000  19.000000  20.000000  21.000000  22.000000  23.000000
max    24.000000  25.000000  26.000000  27.000000  28.000000  29.000000

In [12]:
df.head()

      column1  column2  column3  column4  column5  column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [14]:
df[['column1','column2','column3']]

      column1  column2  column3
Row1        0        1        2
Row2        6        7        8
Row3       12       13       14
Row4       18       19       20
Row5       24       25       26

In [15]:
df['column2']

Row1     1
Row2     7
Row3    13
Row4    19
Row5    25
Name: column2, dtype: int32

In [16]:
type(df['column1'])

pandas.core.series.Series

In [20]:
df.loc[['Row1','Row2','Row3']]

      column1  column2  column3  column4  column5  column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17

In [21]:
df.head()

      column1  column2  column3  column4  column5  column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [22]:
df.iloc[2:4,2:4]

      column3  column4
Row3       14       15
Row4       20       21

In [24]:
df.iloc[-1,3:].values

array([27, 28, 29])

In [25]:
df

      column1  column2  column3  column4  column5  column6
Row1        0        1        2        3        4        5
Row2        6        7        8        9       10       11
Row3       12       13       14       15       16       17
Row4       18       19       20       21       22       23
Row5       24       25       26       27       28       29

In [26]:
df.isnull()

      column1  column2  column3  column4  column5  column6
Row1    False    False    False    False    False    False
Row2    False    False    False    False    False    False
Row3    False    False    False    False    False    False
Row4    False    False    False    False    False    False
Row5    False    False    False    False    False    False